import pandas as pd
import matplotlib.pyplot as plt

# 定义食物类别分类字典
food_categories_full = {
    '白菜': '蔬菜、菌藻、水果类',
    '扁豆': '蔬菜、菌藻、水果类',
    '菠菜': '蔬菜、菌藻、水果类',
    '橙': '蔬菜、菌藻、水果类',
    '带鱼': '畜、禽、鱼、蛋类及制品',
    '稻米': '谷、薯类',
    '地瓜': '谷、薯类',
    '豆腐': '奶、干豆、坚果、种子类及制品',
    '豆芽': '蔬菜、菌藻、水果类',
    '豆油': '植物油类',
    '粉条': '谷、薯类',
    '干豆腐': '奶、干豆、坚果、种子类及制品',
    '海带': '蔬菜、菌藻、水果类',
    '胡萝卜': '蔬菜、菌藻、水果类',
    '花生米': '奶、干豆、坚果、种子类及制品',
    '黄豆': '奶、干豆、坚果、种子类及制品',
    '黄瓜': '蔬菜、菌藻、水果类',
    '黄花鱼': '畜、禽、鱼、蛋类及制品',
    '火腿肠': '畜、禽、鱼、蛋类及制品',
    '鸡蛋': '畜、禽、鱼、蛋类及制品',
    '鸡肉': '畜、禽、鱼、蛋类及制品',
    '韭菜': '蔬菜、菌藻、水果类',
    '卷心菜': '蔬菜、菌藻、水果类',
    '萝卜': '蔬菜、菌藻、水果类',
    '蜜瓜': '蔬菜、菌藻、水果类',
    '明太鱼': '畜、禽、鱼、蛋类及制品',
    '木耳': '蔬菜、菌藻、水果类',
    '南瓜': '蔬菜、菌藻、水果类',
    '牛奶': '奶、干豆、坚果、种子类及制品',
    '牛肉': '畜、禽、鱼、蛋类及制品',
    '苹果': '蔬菜、菌藻、水果类',
    '葡萄': '蔬菜、菌藻、水果类',
    '荞麦面': '谷、薯类',
    '茄汁沙丁鱼': '畜、禽、鱼、蛋类及制品',
    '茄子': '蔬菜、菌藻、水果类',
    '芹菜': '蔬菜、菌藻、水果类',
    '青椒': '蔬菜、菌藻、水果类',
    '酸菜': '蔬菜、菌藻、水果类',
    '酸奶': '奶、干豆、坚果、种子类及制品',
    '蒜台': '蔬菜、菌藻、水果类',
    '土豆': '谷、薯类',
    '五花猪肉': '畜、禽、鱼、蛋类及制品',
    '西瓜': '蔬菜、菌藻、水果类',
    '西红柿': '蔬菜、菌藻、水果类',
    '香菇': '蔬菜、菌藻、水果类',
    '香蕉': '蔬菜、菌藻、水果类',
    '小麦粉': '谷、薯类',
    '小米': '谷、薯类',
    '杏鲍菇': '蔬菜、菌藻、水果类',
    '洋葱': '蔬菜、菌藻、水果类',
    '油菜': '蔬菜、菌藻、水果类',
    '柚子': '蔬菜、菌藻、水果类',
    '鱼丸': '畜、禽、鱼、蛋类及制品',
    '玉米面': '谷、薯类',
    '炸鸡块': '畜、禽、鱼、蛋类及制品',
    '芝麻油': '植物油类',
    '猪排骨': '畜、禽、鱼、蛋类及制品',
    '猪肉': '畜、禽、鱼、蛋类及制品',
    '猪肉瘦': '畜、禽、鱼、蛋类及制品',
    '紫菜': '蔬菜、菌藻、水果类'
}

# 将数据转换为DataFrame
df = pd.DataFrame(list(food_categories_full.items()), columns=['Food', 'Category'])

# 按类别统计食物数量
category_counts = df['Category'].value_counts()
plt.rcParams['font.sans-serif'] = ['SimHei']  # 使用SimHei字体
plt.rcParams['axes.unicode_minus'] = False  # 正确显示负号
# 创建条形图进行可视化
plt.figure(figsize=(10, 6))
category_counts.plot(kind='bar')
plt.title('Food Categories Distribution')
plt.xlabel('Category')
plt.ylabel('Number of Foods')
plt.xticks(rotation=45, ha='right')
plt.tight_layout()

# 显示图表
plt.show()
